"AU Direct Debit" = "AU otsekorraldus";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "Alipay";

"BLIK" = "BLIK";

"Bacs Direct Debit" = "BACS otsekorraldus";

"Bancontact" = "Bancontact";

"Boleto" = "Boleto";

"Card" = "Kaart";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Konbini" = "Konbini";

"Link" = "Link";

"NetBanking" = "NetBanking";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "SEPA deebet";

"Sofort" = "Sofort";

"Swish" = "Swish";

"Timed out authenticating your payment method -- try again" = "Makseviisi autentimise toiming aegus – proovige uuesti";

"UPI" = "UPI";

"US bank account" = "Ameerika Ühendriikide pangakonto";

"Unknown" = "Tundmatu";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Makseviisi ei õnnestunud autentida. Palun valige muu makseviis ja proovige uuesti.";

"WeChat Pay" = "WeChat Pay";

"giropay" = "Giropay";

"iDEAL" = "iDEAL";
